Revit 2027 API
ElementWorksetFilter(WorksetId, Boolean) Constructor
 Constructs a new instance of a filter to match elements in a given workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementWorksetFilter(
	WorksetId worksetId,
	bool inverted
)
Public Sub New (
	worksetId As WorksetId,
	inverted As Boolean
)
public:
ElementWorksetFilter(
	WorksetId^ worksetId,
	bool inverted
)
new :
        worksetId : WorksetId *
        inverted : bool -> ElementWorksetFilter
Parameters
worksetId WorksetId
 The workset id to match.
inverted Boolean
 True if the filter should match all elements which are not in the given workset.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementWorksetFilter Class
ElementWorksetFilter Overload
Autodesk.Revit.DB Namespace